<?php
/*================================================================================
 *--------------------------------------------------------------------------------
 *
 *	Inicio de sesión
 *
 *--------------------------------------------------------------------------------
================================================================================*/

/*================================================================================
 * Tomamos los parametros
================================================================================*/
$usuario = Input::POST("usuario");
$clave = Input::POST("clave");

/*================================================================================
 * Validamos el usuario y la contraseña
================================================================================*/
$objMesa = MesasModel::BuscarPorUsuario($usuario);

if($objMesa->getClave() != $clave) {
    throw new Exception("Contraseña invalida.");
}

if($objMesa->getStatus() == "CERRADA") {
    throw new Exception("Esta mesa esta cerrada.");
}

$objMesa->setStatus("OCUPADA");

/*================================================================================
 * Iniciamos la sesión
================================================================================*/
$objRestaurant = new RestaurantModel($objMesa->getIdRestaurant());
Sesion::CrearCliente($objRestaurant->getId(), $objMesa->getUsuario());
Conexion::getMysql()->Commit();

/*================================================================================
 * Retornamos la salida
================================================================================*/
echo json_encode( $respuesta );